Услуги/src/Documents/НачисленияСотрудникам/НачисленияСотрудникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачисленияСотрудникам</name>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВидыГрафиковРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Услуги/src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныеДанные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <recalculations>
    <name>Перерасчет</name>
    <dimensions>
      <name>Сотрудник</name>
    </dimensions>
  </recalculations>
</mdclass:CalculationRegister>

Услуги/src/ChartsOfCalculationTypes/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Невыход</name>
      <description>Невыход</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Премия</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

Услуги/src/Documents/НачисленияСотрудникам/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Начисления.Записывать = Истина;
	
	// Регистр Начисления
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаНачисления.ДатаОкончания);
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаНачисления.ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.ГрафикРаботы = ТекСтрокаНачисления.ГрафикРаботы;
		Движение.ИсходныеДанные = ТекСтрокаНачисления.Начислено;
		
	КонецЦикла;
	
	// Записать движения регистров.
	Движения.Начисления.Записать();
	
	// Получить список всех сотрудников, содержащихся в документе.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	| НачисленияСотрудникамНачисления.Сотрудник
	|ИЗ
	| Документ.НачисленияСотрудникам.Начисления КАК НачисленияСотрудникамНачисления
	|
	|ГДЕ
	| НачисленияСотрудникамНачисления.Ссылка = &ТекущийДокумент");
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	// Сформировать список сотрудников.
	ТаблЗнач = Запрос.Выполнить().Выгрузить();
	МассивСотрудников = ТаблЗнач.ВыгрузитьКолонку("Сотрудник");
	
	// Вызов процедуры РассчитатьНачисления из общего модуля	
	ПроведениеРасчетов.РассчитатьНачисления(Движения.Начисления,
		ПланыВидовРасчета.ОсновныеНачисления.Оклад, МассивСотрудников);
	Движения.Начисления.Записать( , Истина);
	
	ПроведениеРасчетов.РассчитатьНачисления(Движения.Начисления,
		ПланыВидовРасчета.ОсновныеНачисления.Премия, МассивСотрудников);
		
	Движения.Начисления.Записать( , Истина);

КонецПроцедуры
